{"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "registered_name": null, "name": "input_2", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 31030, "output_dim": 500, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, null]}, "name": "embedding_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "registered_name": null, "name": "input_3", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "registered_name": null, "name": "input_4", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1000, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null, "build_config": {"input_shape": [[null, null, 500], [null, 1000], [null, 1000]]}, "name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0, {}], ["input_3", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 1000], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "registered_name": null, "name": "input_5", "inbound_nodes": []}, {"module": null, "class_name": "AttentionLayer", "config": {"name": "attention_layer", "trainable": true, "dtype": "float32"}, "registered_name": "AttentionLayer", "build_config": {"input_shape": [[null, 80, 1000], [null, null, 1000]]}, "name": "attention_layer", "inbound_nodes": [[["input_5", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concat", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, null, 1000], [null, null, 1000]]}, "name": "concat", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["attention_layer", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 31030, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [null, null, 2000]}, "name": "time_distributed", "inbound_nodes": [[["concat", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["input_5", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["time_distributed", 0, 0], ["lstm_1", 0, 1], ["lstm_1", 0, 2]]}, "keras_version": "2.15.0", "backend": "tensorflow"}